Generate_blockMeshDict/placa_Inclinada/original/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance	1e-6; //1e-08
        relTol          0.001;
        smoother        DIC;
        nPreSweeps	0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 1000;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        minIter         2;
    }

    pFinal
    {
     	solver          PCG;
        preconditioner
        {
                preconditioner          GAMG;
                tolerance	1e-6; //1e-08
                relTol          0;
                nVcycles        2;
                smoother        DICGaussSeidel;
                nPreSweeps	2;
                nPostSweeps     2;
                nFinestSweeps   2;
                cacheAgglomeration true;
                nCellsInCoarsestLevel 1000;
                agglomerator    faceAreaPair;
                mergeLevels     1;
                minIter         2;
        }

	tolerance	1e-8;
        relTol          0;
        maxIter         20;
    }

    "(U|k|epsilon|omega)"
    {
     	solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance	1e-8;
        relTol          0;
        nSweeps         2;
    }

}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 3;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        "(U|k|omega|nut)"   0.7;
    }
}


// ************************************************************************* //
